OpenFOAM-3.0.0/cases/cylinder2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0095 		0 		-0.005)	//0
    (0.05		0 		-0.005)	//1
    (0.8		0 		-0.005)	//2
    (0.8		0.03535535 	-0.005)	//3
    (0.03535535		0.03535535 	-0.005)	//4
    (0.006717515	0.006717515 	-0.005)	//5
    (0.8		0.25 		-0.005)		//6
    (0.03535535 	0.25		-0.005)		//7
    (0 			0.25 		-0.005)		//8
    (0 			0.05 		-0.005)		//9
    (0 			0.0095 		-0.005)
    (-0.0095 		0 		-0.005)
    (-0.05 		0 		-0.005)		//12			
    (-0.25		0 		-0.005)						
    (-0.25		0.03535535 	-0.005)		//14
    (-0.03535535 	0.03535535 	-0.005)
    (-0.006717515 	0.006717515 	-0.005)
    (-0.25 		0.25 		-0.005)
    (-0.03535535 	0.25 		-0.005)		//18
    (0.0095 		0		0.005)
    (0.05 		0 		0.005)		//20
    (0.8		0 		0.005)
    (0.8		0.03535535 	0.005)
    (0.03535535 	0.03535535 	0.005)
    (0.006717515 	0.006717515 	0.005)
    (0.8		0.25 		0.005)
    (0.03535535 	0.25 		0.005)
    (0 			0.25 		0.005)
    (0 			0.05 		0.005)			//28	
    (0 			0.0095 		0.005)
    (-0.0095 		0 		0.005)
    (-0.05 		0 		0.005)			//31
    (-0.25 		0 		0.005)
    (-0.25 		0.03535535 	0.005)
    (-0.03535535 	0.03535535 	0.005)
    (-0.006717515 	0.006717515 	0.005)
    (-0.25 		0.25 		0.005)
    (-0.03535535 	0.25 		0.005)
);

blocks
(
    hex (5 4 9 10 24 23 28 29) (85 20 1) simpleGrading (100 1 1)	//c
    hex (0 1 4 5 19 20 23 24) (85 20 1) simpleGrading (100 1 1) 	//c
    hex (1 2 3 4 20 21 22 23) (300 20 1) simpleGrading (1 1 1)  //out
    hex (4 3 6 7 23 22 25 26) (300 80 1) simpleGrading (1 1 1) //out
    hex (9 4 7 8 28 23 26 27) (20 80 1) simpleGrading (1 1 1) //out
    hex (15 16 10 9 34 35 29 28) (85 20 1) simpleGrading (0.01 1 1) //c
    hex (12 11 16 15 31 30 35 34) (85 20 1) simpleGrading (0.01 1 1) //c	
    hex (13 12 15 14 32 31 34 33) (80 20 1) simpleGrading (1 1 1)	//in
    hex (14 15 18 17 33 34 37 36) (80 80 1) simpleGrading (1 1 1)	//in
    hex (15 9 8 18 34 28 27 37) (20 80 1) simpleGrading (1 1 1)		//top
);

edges
(
    arc 0 5 	(0.009176295	0.002458781 	-0.005) //19 20 23 24
    arc 19 24 	(0.009176295	0.002458781 	0.005)

    arc 5 10 	(0.002458781 	0.009176295 	-0.005) //24 23 28 29
    arc 24 29 	(0.002458781 	0.009176295  	0.005)

    arc 4 9 	(0.012940952 	0.048296291	-0.005)
    arc 23 28 	(0.012940952 	0.048296291  	0.005)

    arc 1 4 	(0.048296291 	0.012940952 	-0.005) 
    arc 20 23 	(0.048296291 	0.012940952 	0.005)
    
    arc 11 16 	(-0.009176295 	0.002458781 	-0.005) //31 30 35 34
    arc 30 35 	(-0.009176295 	0.002458781 	0.005)

    arc 16 10 	(-0.002458781 	0.009176295 	-0.005) //34 35 29 28
    arc 35 29 	(-0.002458781 	0.009176295 	0.005)

    arc 34 28 	(-0.012940952 	0.048296291  	0.005)

    arc 12 15 	(-0.048296291 	0.012940952 	-0.005)
    arc 31 34 	(-0.048296291 	0.012940952	0.005)

    arc 15 9 	(-0.012940952 	0.048296291 	-0.005)


    
);

boundary
(
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 20 19)
            (1 2 21 20)
            (12 11 30 31)
            (13 12 31 32)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (2 3 22 21)
            (3 6 25 22)
        );
    }
    open
    {
        type patch;
        faces
        (
            (7 8 27 26)
            (6 7 26 25)
            (8 18 37 27)
            (18 17 36 37)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (14 13 32 33)
            (17 14 33 36)
        );
    }
    cyl
    {
        type wall;
        faces
        (
            (10 5 24 29)
            (5 0 19 24)
            (16 10 29 35)
            (11 16 35 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

